app/Controllers/danasosial.php

SELECT *
FROM `users`
WHERE `users`.`id` = '22'
---
    private function loadUserData()
    {
        if ($this->userData === null && $this->userId) {
            $this->userData = $this->getUserModel()->find($this->userId);