app/Controllers/Faktor.php

UPDATE `faktor` SET `is_approved` = 1, `approved_by` = '1', `approved_at` = '2025-05-19 17:25:12'
---
    public function approveSemua()
    {
        date_default_timezone_set('Asia/Jakarta');
        $userId = service('authentication')->id();
        $dataUpdate = [
            'is_approved' => 1,
            'approved_by' => $userId,
            'approved_at' => date('Y-m-d H:i:s'),
        ];

        $this->faktorModel->builder()->update($dataUpdate);