app/Controllers/Faktor.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `infobpr`
WHERE `infobpr`.`id` = '1'
---
    public function index()
    {
        if (!$this->auth->check()) {
            $redirectURL = session('redirect_url') ?? '/login';
            unset($_SESSION['redirect_url']);
            return redirect()->to($redirectURL);
        }


        $userId = $this->auth->id();
        $user = $this->userModel->find($userId);
        $infobprId = $this->auth->id();
        $infobpr = $this->infobprModel->find($infobprId);