app/Controllers/Pdfself.php

    public function uploadPdf()
    {
        $validationRules = [
            'pdf1' => [
                'rules' => 'if_exist|uploaded[pdf1]|ext_in[pdf1,pdf]|max_size[pdf1,2048]', // Max 2MB
                'errors' => [
                    'uploaded' => 'File PDF 1 tidak diunggah.',
                    'ext_in' => 'File PDF 1 harus berekstensi .pdf.',
                    'max_size' => 'Ukuran file PDF 1 terlalu besar (maksimal 2MB).'
                ]
            ],
            'pdf2' => [
                'rules' => 'if_exist|uploaded[pdf2]|ext_in[pdf2,pdf]|max_size[pdf2,2048]', // Max 2MB
                'errors' => [
                    'uploaded' => 'File PDF 2 tidak diunggah.',
                    'ext_in' => 'File PDF 2 harus berekstensi .pdf.',
                    'max_size' => 'Ukuran file PDF 2 terlalu besar (maksimal 2MB).'
                ]
            ]
        ];

        if (!$this->validate($validationRules)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $userId = service('authentication')->id();
        $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

            return redirect()->back()->with('error', 'Data BPR atau Periode tidak ditemukan.');
        }

        $showfaktorRecord = $this->showfaktorModel
            ->where('kodebpr', $kodebpr)
            ->where('periode_id', $periodeId)
            ->first();
---
SELECT *
FROM `showfaktor`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1


        // Only update if there's actual data to update
        if (!empty($updateData)) {
            $this->showfaktorModel->update($showfaktorRecord['id'], $updateData);
---
UPDATE `showfaktor` SET `pdf1_filename` = '1750926323_f5abee65da46dc64e286.pdf'
WHERE `showfaktor`.`id` IN ('1')

    public function generateFullReport()
    {

        $userId = service('authentication')->id();
        $userModel = new M_user();
        $user = $userModel->find($userId);
        $kodebpr = $user['kodebpr'] ?? null;
        $periodeId = session('active_periode');

        if (!$kodebpr || !$periodeId) {
            return redirect()->back()->with('error', 'Data BPR atau Periode tidak ditemukan.');
        }

        try {
            $userId = service('authentication')->id();
            if (!$userId) {
                return redirect()->back()->with('error', 'User not authenticated.');
            }

            $userModel = new M_user();
            $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

                return redirect()->back()->with('error', 'Data Periode tidak ditemukan untuk ID: ' . $periodeId);
            }

            $nilaifaktor = $this->nilaifaktorModel
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();

            $faktorData = $this->faktorModel->getAllData();

            // Ambil data summary dan analisa positif/negatif dari salah satu baris nilaifaktor.
            $nilaifaktorSummaryAndAnalysisData = $this->nilaifaktorModel
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first(); // Mengambil baris pertama yang cocok
---
SELECT *
FROM `nilaifaktor`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
SELECT *
FROM `nilaifaktor`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infobprData['kesimpulan'] = 'Tidak ada kesimpulan.';
            }

            $nilaifaktor2 = $this->nilaifaktor2Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor2`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor2Data = $this->faktor2Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 2
            $nilaifaktor2SummaryAndAnalysisData = $this->nilaifaktor2Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor2`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor3 = $this->nilaifaktor3Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor3`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor3Data = $this->faktor3Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 3
            $nilaifaktor3SummaryAndAnalysisData = $this->nilaifaktor3Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor3`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf3['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor4 = $this->nilaifaktor4Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor4`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor4Data = $this->faktor4Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 4
            $nilaifaktor4SummaryAndAnalysisData = $this->nilaifaktor4Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor4`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf4['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor5 = $this->nilaifaktor5Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor5`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor5Data = $this->faktor5Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 5
            $nilaifaktor5SummaryAndAnalysisData = $this->nilaifaktor5Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor5`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf5['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor6 = $this->nilaifaktor6Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor6`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor6Data = $this->faktor6Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 6
            $nilaifaktor6SummaryAndAnalysisData = $this->nilaifaktor6Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor6`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf6['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor7 = $this->nilaifaktor7Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();

            $faktor7Data = $this->faktor7Model->getAllData();

            $nilaifaktor7SummaryAndAnalysisData = $this->nilaifaktor7Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor7`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
SELECT *
FROM `nilaifaktor7`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf7['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor8 = $this->nilaifaktor8Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor8`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor8Data = $this->faktor8Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 8
            $nilaifaktor8SummaryAndAnalysisData = $this->nilaifaktor8Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor8`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf8['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor9 = $this->nilaifaktor9Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor9`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor9Data = $this->faktor9Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 9
            $nilaifaktor9SummaryAndAnalysisData = $this->nilaifaktor9Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor9`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf9['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor10 = $this->nilaifaktor10Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor10`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor10Data = $this->faktor10Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 10
            $nilaifaktor10SummaryAndAnalysisData = $this->nilaifaktor10Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor10`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf10['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor11 = $this->nilaifaktor11Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor11`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor11Data = $this->faktor11Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 11
            $nilaifaktor11SummaryAndAnalysisData = $this->nilaifaktor11Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor11`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf11['negatifhasil'] = 'Tidak ada data.';
            }

            $nilaifaktor12 = $this->nilaifaktor12Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->findAll();
---
SELECT *
FROM `nilaifaktor12`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'

            $faktor12Data = $this->faktor12Model->getAllData();

            // Ambil data summary dan analisa positif/negatif untuk FAKTOR 12
            $nilaifaktor12SummaryAndAnalysisData = $this->nilaifaktor12Model
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `nilaifaktor12`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                $infoDataForPdf12['negatifhasil'] = 'Tidak ada data.';
            }

            $showfaktorSummaryAndAnalysisData = $this->showfaktorModel
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `showfaktor`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1

                ];
            }

            $showfaktortandatanganData = $this->showfaktorModel
                ->where('kodebpr', $kodebpr)
                ->where('periode_id', $periodeId)
                ->first();
---
SELECT *
FROM `showfaktor`
WHERE `kodebpr` = '01'
AND `periode_id` = '1'
 LIMIT 1