app/Controllers/Periodetks.php

    public function index()
    {
        $user = $this->userModel->find(user_id());
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'