app/Controllers/periode.php

    public function index()
    {
        // Redirect jika sudah ada periode aktif
        $user = $this->userModel->find(user_id());
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function select()
    {
        $periodeId = $this->request->getPost('periode_id');
        $user = $this->userModel->find(user_id());
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'