app/Controllers/Risikooperasional.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function __construct()
    {
        date_default_timezone_set('Asia/Jakarta');

        $this->db = \Config\Database::connect();

        $this->paramprofilrisikoModel = new M_paramprofilrisiko();
        $this->periodeModel = new M_periodeprofilresiko();
        $this->userModel = new M_user();
        $this->komentarModel = new M_profilrisikocomments();
        $this->nilaiModel = new M_risikooperasional();
        $this->infobprModel = new M_infobpr();
        $this->commentReadsModel = new M_profilrisikocommentsread();
        $this->showprofilresikoModel = new M_showprofilresiko();

        helper('url');
        $this->session = service('session');
        $this->auth = service('authentication');

        $this->userId = $this->auth->id();
        if ($this->userId) {
            $user = $this->userModel->find($this->userId);

SELECT `r`.*, `u`.`fullname`
FROM `risikooperasional` as `r`
LEFT JOIN `users` as `u` ON `u`.`id` = `r`.`user_id`
WHERE `r`.`kodebpr` = '001811'
AND `r`.`periode_id` = '10'
AND `r`.`faktor1id` IN (36,37,38,39,40,41,42,43,44,45,46,47)
---
    public function getFactorsData()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setStatusCode(403);
        }

        $nilaiData = $this->db->table('risikooperasional as r')
            ->select('r.*, u.fullname')
            ->join('users as u', 'u.id = r.user_id', 'left')
            ->where('r.kodebpr', $this->userKodebpr)
            ->where('r.periode_id', $this->periodeId)
            ->whereIn('r.faktor1id', range(36, 47))
            ->get()
            ->getResultArray();