app/Controllers/Showtks.php

SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    private function initializeUser()
    {
        if ($this->auth->isLoggedIn()) {
            $this->userId = $this->auth->id();
            $user = $this->userModel->find($this->userId);