app/Models/M_commentreads.php

    public function countUnreadCommentsForUserByFactor($faktorId, $kodebpr, $userId, $periodeId): int
    {
        // Get all comment IDs for the given factor, kodebpr, and periode
        $commentsInFactor = $this->db->table('faktor_comments')
            ->select('id')
            ->where('faktor1id', $faktorId)
            ->where('kodebpr', $kodebpr)
            ->where('periode_id', $periodeId)
            ->where('user_id !=', $userId) // We only care about comments from *other* users
            ->get()
            ->getResultArray();
---
SELECT `id`
FROM `faktor_comments`
WHERE `faktor1id` = '7'
AND `kodebpr` = '01'
AND `periode_id` = '1'
AND `user_id` != '1'