app/Models/M_faktor7.php

SELECT *
FROM `faktor7`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();