app/Models/M_faktor10.php

SELECT *
FROM `faktor10`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();