app/Models/M_faktor9.php

SELECT *
FROM `faktor9`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();