app/Models/M_faktor8.php

SELECT *
FROM `faktor8`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();