app/Models/M_faktor3.php

SELECT *
FROM `faktor3`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();