app/Models/M_faktorkomentar.php

SELECT `faktor_comments`.*, `users`.`fullname`
FROM `faktor_comments`
LEFT JOIN `users` ON `users`.`id` = `faktor_comments`.`user_id`
WHERE `faktor_comments`.`faktor1id` = '1'
ORDER BY `faktor_comments`.`created_at` ASC
---
    public function getKomentarByFaktorId($faktorId)
    {
        return $this->db->table($this->table)
            ->select('faktor_comments.*, users.fullname')
            ->join('users', 'users.id = faktor_comments.user_id', 'left')
            ->where('faktor_comments.faktor1id', $faktorId) // INI KUNCI FILTERING
            ->orderBy('faktor_comments.created_at', 'ASC')
            ->get()
            ->getResultArray();