app/Models/M_faktor12.php

SELECT *
FROM `faktor12`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();