app/Models/M_faktor5.php

SELECT *
FROM `faktor5`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();