app/Models/M_faktor11.php

SELECT *
FROM `faktor11`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();