app/Models/M_faktor6.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `faktor6`