app/Models/M_faktor.php

SELECT *
FROM `faktor`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();