app/Models/M_fraudinternal.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `fraudinternal`