app/Models/M_infobpr.php

SELECT *
FROM `infobpr`
---
    public function getAllData()
    {
        return $this->findAll();

SELECT *
FROM `infobpr`
WHERE `kodebpr` = '01'
 LIMIT 1
---
    public function getBprByKode($kodebpr)
    {
        return $this->where('kodebpr', $kodebpr)->first();