app/Models/M_keuangandirdekompshm.php

SELECT *
FROM `keuangandirdekompshm`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();