app/Models/M_kehadirandekom.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `kehadirandekom`