app/Models/M_keluargadirdekompshm.php

SELECT *
FROM `keluargadirdekompshm`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();