app/Models/M_masalahhukum.php

SELECT *
FROM `masalahhukum`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();