app/Models/M_nilaifaktor.php

DELETE FROM `nilaifaktor`
WHERE `faktor1id` = '1'
---
    public function hapus($faktor1id)
    {
        // Menghapus data berdasarkan faktor1id
        $deleteResult = $this->builder->delete(['faktor1id' => $faktor1id]);

UPDATE `nilaifaktor` SET `nilai` = '2', `keterangan` = '2'
WHERE `faktor1id` = '2'
---
    public function ubahBerdasarkanFaktor1Id($data, $faktor1id)
    {
        // Update data berdasarkan faktor1id
        $this->builder->where('faktor1id', $faktor1id);
        $updateResult = $this->builder->update($data);  // Melakukan update data