app/Models/M_paketkebijakandirdekom.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `paketkebijakandirdekom`