app/Models/M_periodetks.php

SELECT *
FROM `periodetks`
WHERE `kodebpr` = '001811'
---
    public function getPeriodeByBpr($kodebpr)
    {
        return $this->where('kodebpr', $kodebpr)->findAll();