app/Models/M_penjelasanumum.php

SELECT *
FROM `penjelasanumum`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();