app/Models/M_profilrisikocommentsread.php

    public function countUnreadCommentsForUserByFactor($faktorId, $subkategori, $kodebpr, $userId, $periodeId): int
    {
        // Get all comment IDs for the given factor, kodebpr, and periode
        $commentsInFactor = $this->db->table('profilrisiko_comments')
            ->select('id')
            ->where('faktor1id', $faktorId)
            ->where('subkategori', $subkategori)
            ->where('kodebpr', $kodebpr)
            ->where('periode_id', $periodeId)
            ->where('user_id !=', $userId) // We only care about comments from *other* users
            ->get()
            ->getResultArray();
---
SELECT `id`
FROM `profilrisiko_comments`
WHERE `faktor1id` = 36
AND `subkategori` = 'OPERASIONALINHEREN'
AND `kodebpr` = '001811'
AND `periode_id` = '10'
AND `user_id` != '1'