app/Models/M_rasiogaji.php

SELECT *
FROM `rasiogaji`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();