app/Models/M_rapat.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `rapat`