app/Models/M_sahamdirdekom.php

SELECT *
FROM `sahamdirdekom`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();