app/Models/M_shmusahadirdekom.php

SELECT *
FROM `shmusahadirdekom`
---
    public function getAllData($filter_columns = [])
    {
        $builder = $this->builder;

        if (!empty($filter_columns)) {
            foreach ($filter_columns as $column) {
                $builder->where($column . ' IS NOT NULL', null, false);
                $builder->where($column . ' !=', '');
            }
        }

        return $builder->get()->getResultArray();