app/Models/M_shmdirdekomlain.php

SELECT *
FROM `shmdirdekomlain`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();