app/Models/M_showtks.php

SELECT *
FROM `showtks`
WHERE `kodebpr` = '001811'
AND `periode_id` = '1'
 LIMIT 1
UPDATE `showtks` SET `kodebpr` = '001811', `periode_id` = '1', `tahun` = '2025'
WHERE `showtks`.`id` IN ('1')
---
    public function simpanProfilRisiko($data)
    {
        $existing = $this->where('kodebpr', $data['kodebpr'])
            ->where('periode_id', $data['periode_id'])
            ->first();

        if ($existing) {
            return $this->update($existing['id'], $data);

SELECT *
FROM `showtks`
WHERE `kodebpr` = '001811'
AND `periode_id` = '1'
 LIMIT 1
---
    public function getByKodebprAndPeriode($kodebpr, $periodeId)
    {
        return $this->where('kodebpr', $kodebpr)
            ->where('periode_id', $periodeId)
            ->first();