app/Models/M_strukturkomite.php

SELECT *
FROM `strukturkomite`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();