app/Models/M_tgjwbdir.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `tgjwbdir`