app/Models/M_tgjwbkomite.php

SELECT *
FROM `tgjwbkomite`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();