app/Models/M_tgjwbdekom.php

SELECT *
FROM `tgjwbdekom`
---
    public function getAllData()
    {
        return $this->builder->get()->getResultArray();