app/Models/M_transaksikepentingan.php

    public function getAllData()
    {
        return $this->builder->get()->getResultArray();
---
SELECT *
FROM `transaksikepentingan`